'''
Две старушки
Две старушки идут навстречу друг другу с постоянными скоростями V 1 и V 2 км/ч.
Определите, через какое время старушки встретятся, если расстояние между ними равно S км.
Формат входных данных
На вход программе подаются три числа с плавающей точкой , каждое на отдельной строке.

Формат выходных данных
Программа должна вывести одно число в соответствии с условием задачи.

Примечание. Это очень быстрые старушки.
'''

s=float(input())
v1=float(input())
v2=float(input())
print(s /( v2+ v1))
