#Python является:
#интерпретируемым языком

#Преимуществами языка Python являются
#платформонезависимость
#встраиваемость
#простота
#наличие большой библиотеки классов
#динамическая типизация (для несложных программ)

#Недостатками языка Python являются
#низкая скорость выполнения программ
#динамическая типизация (для сложных программ)

#Какие задачи можно решать, используя язык Python?
#создание системных утилит
#создание графических приложений GUI
#создание приложений баз данных
#создание веб-приложений
#создание приложений анализа данных
