'''
Повторяй за мной 2
Напишите программу, которая считывает три строки по очереди, а затем выводит их в обратной последовательности, каждую на отдельной строчке.

Формат входных данных
На вход программе подается три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введенные строки в обратной последовательности, каждую на отдельной строке.

Примечание. Используйте 3 переменные для сохранения введённых строк текста.
'''

word1=input()
word2=input()
word3=input()
print(word3)
print(word2)
print(word1)